In [276]:
import pandas as pd
import numpy as np
import pathfinder as pf

# Parte 1: População geral

In [277]:
filename = "censo_1872-003_p1.csv"
path = pf.find_file(filename)
df = pd.read_csv(path)

In [278]:
df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37,Unnamed: 38,Unnamed: 39
0,NaN,NaN,NaN,NaN,Estados Civis,NaN,NaN,NaN,NaN,NaN,...,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Sexos,NaN,NaN,dos Homens,NaN,NaN,das Mulheres,NaN,NaN,...,Meninos,NaN,NaN,Meninas,NaN,NaN,Casas,NaN,NaN,NaN
2,Províncias e Município Neutro,Homens,Mulheres,Total,Solteiros,Casados,Viúvos,Solteiras,Casadas,Viúvas,...,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total,Habitadas,Desabitadas,Total,Número de fogos
3,Amazonas,30983,2564,56631,24959,5105,919,19214,4714,1720,...,824,5056,5880,371,3269,3640,7661,229,7890,7811
4,Pará,128589,11919,247779,94848,28935,4806,86825,26280,6085,...,5768,25753,31521,3441,25020,28461,38978,2077,41055,39521
5,Maranhão,141942,14215,284101,103283,33644,5015,102302,32337,7520,...,8739,28142,36881,4844,29567,34411,47166,1405,48571,49282
6,Piauí,90322,8810,178427,63294,23323,3705,59547,23371,5187,...,1777,15960,17737,1024,16968,17992,29208,223,29431,30770
7,Ceará,350906,33886,689773,241692,99915,9299,224509,99849,14509,...,10021,83808,93829,5399,85087,90486,99901,2989,102890,100207
8,Rio Grande do Norte,112721,10823,220959,80803,26832,5086,75915,26735,5588,...,2643,18662,21305,2058,19857,21915,36710,706,37416,37320
9,Paraíba,179433,17526,354700,119403,53474,6556,112332,53274,9661,...,6630,44061,50691,3894,45830,49724,43767,522,44289,44438

In [279]:
print(df.columns)

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25', 'Instrução',
       'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30',
       'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34',
       'Unnamed: 35', 'Unnamed: 36', 'Unnamed: 37', 'Unnamed: 38',
       'Unnamed: 39'],
      dtype='object')

## Gêneros

In [280]:
sexos = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3']]
sexos.head()

                      Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3
0                            NaN        NaN        NaN        NaN
1                            NaN      Sexos        NaN        NaN
2  Províncias e Município Neutro     Homens   Mulheres      Total
3                       Amazonas      30983       2564      56631
4                           Pará     128589      11919     247779

In [281]:
sexos_header = sexos.iloc[1]
sexos.columns = sexos_header
sexos = sexos[2:]
sexos.head()

1                            NaN   Sexos       NaN     NaN
2  Províncias e Município Neutro  Homens  Mulheres   Total
3                       Amazonas   30983      2564   56631
4                           Pará  128589     11919  247779
5                       Maranhão  141942     14215  284101
6                          Piauí   90322      8810  178427

In [282]:
sexos_header = sexos.iloc[0]
sexos.columns = sexos_header
sexos = sexos[1:]
print(sexos.shape)
print(sexos.columns)
sexos.head()

(22, 4)
Index(['Províncias e Município Neutro', 'Homens', 'Mulheres', 'Total'], dtype='object', name=2)

2 Províncias e Município Neutro  Homens Mulheres   Total
3                      Amazonas   30983     2564   56631
4                          Pará  128589    11919  247779
5                      Maranhão  141942    14215  284101
6                         Piauí   90322     8810  178427
7                         Ceará  350906    33886  689773

In [283]:
columns_multiindex = pd.MultiIndex.from_tuples([
    #('Gêneros', 'Províncias e Município Neutro'),
    ('', 'Províncias e Município Neutro'),
    ('Gêneros', 'Homens'),
    ('Gêneros', 'Mulheres'),
    ('Gêneros', 'Total')
])

# Atribuindo o MultiIndex às colunas do DataFrame
sexos.columns = columns_multiindex
print(sexos.shape)
sexos

(22, 4)

                                  Gêneros
   Províncias e Município Neutro   Homens Mulheres    Total
3                       Amazonas    30983     2564    56631
4                           Pará   128589    11919   247779
5                       Maranhão   141942    14215   284101
6                          Piauí    90322     8810   178427
7                          Ceará   350906    33886   689773
8            Rio Grande do Norte   112721    10823   220959
9                        Paraíba   179433    17526   354700
10                    Pernambuco   381565    37094   752511
11                       Alagoas   155584    15667   312268
12                       Sergipe    74739     7888   153620
13                         Bahia   630353    58143  1211792
14                Espírito Santo    29607    29871    59478
15              Município Neutro   133880    92153   226033
16                Rio de Janeiro   255806   234281   499087
17                     São Paulo   348304   332438   680742
18                        Paraná    59384    56858   116162
19                Santa Catarina    73088    71730   144818
20             Rio Grande do Sul   191022   176000   367022
21                  Minas Gerais   847592   821684  1669276
22                         Goiás    74968    74775   149743
23                   Mato Grosso    27991    25759    53750
24                         Total  4318699  4100973  8419672

## Estados civis

In [284]:
estados_civis = df[['Unnamed: 0','Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis.head()

,Unnamed: 0,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,Estados Civis,NaN,NaN,NaN,NaN,NaN
1,NaN,dos Homens,NaN,NaN,das Mulheres,NaN,NaN
2,Províncias e Município Neutro,Solteiros,Casados,Viúvos,Solteiras,Casadas,Viúvas
3,Amazonas,24959,5105,919,19214,4714,1720
4,Pará,94848,28935,4806,86825,26280,6085

In [285]:
estados_civis_header = estados_civis.iloc[0]
estados_civis.columns = estados_civis_header
estados_civis = estados_civis[3:]
estados_civis.head()

0       NaN Estados Civis    NaN   NaN     NaN    NaN    NaN
3  Amazonas         24959   5105   919   19214   4714   1720
4      Pará         94848  28935  4806   86825  26280   6085
5  Maranhão        103283  33644  5015  102302  32337   7520
6     Piauí         63294  23323  3705   59547  23371   5187
7     Ceará        241692  99915  9299  224509  99849  14509

In [286]:
columns_multiindex = pd.MultiIndex.from_tuples([
    #('Gêneros', 'Províncias e Município Neutro'),
    ('', 'Províncias e Município Neutro'),
    ('dos Homens', 'Solteiros'),
    ('dos Homens', 'Casados'),
    ('dos Homens', 'Viúvos'),
    ('das Mulheres', 'Solteiras'),
    ('das Mulheres', 'Casadas'),
    ('das Mulheres', 'Viúvas')
])

# Atribuindo o MultiIndex às colunas do DataFrame
estados_civis.columns = columns_multiindex
print(estados_civis.shape)
estados_civis

(22, 7)

                                 dos Homens                  das Mulheres  \
   Províncias e Município Neutro  Solteiros  Casados  Viúvos    Solteiras
3                       Amazonas      24959     5105     919        19214
4                           Pará      94848    28935    4806        86825
5                       Maranhão     103283    33644    5015       102302
6                          Piauí      63294    23323    3705        59547
7                          Ceará     241692    99915    9299       224509
8            Rio Grande do Norte      80803    26832    5086        75915
9                        Paraíba     119403    53474    6556       112332
10                    Pernambuco     258936   111189   11440       240239
11                       Alagoas     102729    47865    4990        99772
12                       Sergipe      48013    24027    2699        50746
13                         Bahia     440556   160204   29593       398473
14                Espírito Santo      19415     9298     894        19251
15              Município Neutro     104036    25763    4081        64074
16                Rio de Janeiro     168391    71842   15573       148840
17                     São Paulo     234386    98864   15054       218684
18                        Paraná      37977    18649    2678        35006
19                Santa Catarina      49985    21351    1752        47122
20             Rio Grande do Sul     139899    45104    6019       124864
21                  Minas Gerais     572728   231947   42917       557389
22                         Goiás      51886    20696    2386        50125
23                   Mato Grosso      18227     7839    1925        17353
24                         Total    2975446  1165866  177387      2752582


    Casadas  Viúvas
3      4714    1720
4     26280    6085
5     32337    7520
6     23371    5187
7     99849   14509
8     26735    5588
9     53274    9661
10   111465   19242
11    46743   10169
12    24795    3340
13   151883   31083
14     9449    1171
15    20174    7905
16    68726   16715
17    96290   17464
18    18332    3520
19    20412    4196
20    41525    9611
21   217353   46942
22    20340    4310
23     6953    1453
24  1121000  227391

In [287]:
estados_civis.drop(columns=('', 'Províncias e Município Neutro'), inplace=True)

In [288]:
df_sex_estados_c = pd.concat([sexos, estados_civis], axis=1)
df_sex_estados_c

                                  Gêneros                   dos Homens  \
   Províncias e Município Neutro   Homens Mulheres    Total  Solteiros
3                       Amazonas    30983     2564    56631      24959
4                           Pará   128589    11919   247779      94848
5                       Maranhão   141942    14215   284101     103283
6                          Piauí    90322     8810   178427      63294
7                          Ceará   350906    33886   689773     241692
8            Rio Grande do Norte   112721    10823   220959      80803
9                        Paraíba   179433    17526   354700     119403
10                    Pernambuco   381565    37094   752511     258936
11                       Alagoas   155584    15667   312268     102729
12                       Sergipe    74739     7888   153620      48013
13                         Bahia   630353    58143  1211792     440556
14                Espírito Santo    29607    29871    59478      19415
15              Município Neutro   133880    92153   226033     104036
16                Rio de Janeiro   255806   234281   499087     168391
17                     São Paulo   348304   332438   680742     234386
18                        Paraná    59384    56858   116162      37977
19                Santa Catarina    73088    71730   144818      49985
20             Rio Grande do Sul   191022   176000   367022     139899
21                  Minas Gerais   847592   821684  1669276     572728
22                         Goiás    74968    74775   149743      51886
23                   Mato Grosso    27991    25759    53750      18227
24                         Total  4318699  4100973  8419672    2975446

                    das Mulheres
    Casados  Viúvos    Solteiras  Casadas  Viúvas
3      5105     919        19214     4714    1720
4     28935    4806        86825    26280    6085
5     33644    5015       102302    32337    7520
6     23323    3705        59547    23371    5187
7     99915    9299       224509    99849   14509
8     26832    5086        75915    26735    5588
9     53474    6556       112332    53274    9661
10   111189   11440       240239   111465   19242
11    47865    4990        99772    46743   10169
12    24027    2699        50746    24795    3340
13   160204   29593       398473   151883   31083
14     9298     894        19251     9449    1171
15    25763    4081        64074    20174    7905
16    71842   15573       148840    68726   16715
17    98864   15054       218684    96290   17464
18    18649    2678        35006    18332    3520
19    21351    1752        47122    20412    4196
20    45104    6019       124864    41525    9611
21   231947   42917       557389   217353   46942
22    20696    2386        50125    20340    4310
23     7839    1925        17353     6953    1453
24  1165866  177387      2752582  1121000  227391

In [289]:
#(            '', 'Províncias e Município Neutro') == "Ceará"
test_index = df_sex_estados_c.set_index((            '', 'Províncias e Município Neutro'))
print(test_index.axes)
test_index.loc[['Ceará', 'Total']]

[Index(['Amazonas', 'Pará', 'Maranhão', 'Piauí', 'Ceará', 'Rio Grande do Norte',
       'Paraíba', 'Pernambuco', 'Alagoas', 'Sergipe', 'Bahia',
       'Espírito Santo', 'Município Neutro', 'Rio de Janeiro', 'São Paulo',
       'Paraná', 'Santa Catarina', 'Rio Grande do Sul', 'Minas Gerais',
       'Goiás', 'Mato Grosso', 'Total'],
      dtype='object', name=('', 'Províncias e Município Neutro')), MultiIndex([(     'Gêneros',    'Homens'),
            (     'Gêneros',  'Mulheres'),
            (     'Gêneros',     'Total'),
            (  'dos Homens', 'Solteiros'),
            (  'dos Homens',   'Casados'),
            (  'dos Homens',    'Viúvos'),
            ('das Mulheres', 'Solteiras'),
            ('das Mulheres',   'Casadas'),
            ('das Mulheres',    'Viúvas')],
           )]

                                   Gêneros                   dos Homens  \
                                    Homens Mulheres    Total  Solteiros
(, Províncias e Município Neutro)
Ceará                               350906    33886   689773     241692
Total                              4318699  4100973  8419672    2975446

                                                   das Mulheres           \
                                   Casados  Viúvos    Solteiras  Casadas
(, Províncias e Município Neutro)
Ceará                                99915    9299       224509    99849
Total                              1165866  177387      2752582  1121000


                                   Viúvas
(, Províncias e Município Neutro)
Ceará                               14509
Total                              227391

In [296]:
df = test_index.loc[['Ceará', 'Total']]
df = df.apply(pd.to_numeric)

# Calcular a mudança percentual entre o slice (linha 0) e o total (linha 1)
percentual_mudanca = df.pct_change().iloc[1] * 100

# Exibir o resultado
percentual_mudanca

Gêneros       Homens        1130.728172
              Mulheres     12002.263472
              Total         1120.643893
dos Homens    Solteiros     1131.089982
              Casados       1066.857829
              Viúvos        1807.592214
das Mulheres  Solteiras     1126.045281
              Casadas       1022.695270
              Viúvas        1467.241023
Name: Total, dtype: float64

In [300]:
df = test_index.loc[['Ceará', 'Total']]
df = df.apply(pd.to_numeric)

# Calcular quanto o slice representa do total
(df.iloc[0] / df.iloc[1]) * 100

Gêneros       Homens       8.125271
              Mulheres     0.826292
              Total        8.192398
dos Homens    Solteiros    8.122883
              Casados      8.570024
              Viúvos       5.242211
das Mulheres  Solteiras    8.156306
              Casadas      8.907136
              Viúvas       6.380640
dtype: float64

In [303]:
### Quantil

In [302]:
# Não sei se faz sentido calcular quantil
df.quantile(0.50)

Gêneros       Homens       2334802.5
              Mulheres     2067429.5
              Total        4554722.5
dos Homens    Solteiros    1608569.0
              Casados       632890.5
              Viúvos         93343.0
das Mulheres  Solteiras    1488545.5
              Casadas       610424.5
              Viúvas        120950.0
Name: 0.5, dtype: float64

## Raças

In [291]:
racas = df[['Unnamed: 0','Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17']]
racas.head()

,Unnamed: 0,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17
0,NaN,Raças,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,dos Homens,NaN,NaN,NaN,das Mulheres,NaN,NaN,NaN
2,Províncias e Município Neutro,Brancos,Pardos,Pretos,Caboclos,Brancas,Pardas,Pretas,Caboclas
3,Amazonas,6911,4210,711,19151,4300,3046,625,17677
4,Pará,49663,46899,9200,22827,42971,46828,7629,21762

In [292]:
racas_header = racas.iloc[0]
racas.columns = racas_header
racas = racas[1:]
racas.head()

,NaN,Raças,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,dos Homens,NaN,NaN,NaN,das Mulheres,NaN,NaN,NaN
2,Províncias e Município Neutro,Brancos,Pardos,Pretos,Caboclos,Brancas,Pardas,Pretas,Caboclas
3,Amazonas,6911,4210,711,19151,4300,3046,625,17677
4,Pará,49663,46899,9200,22827,42971,46828,7629,21762
5,Maranhão,52267,71662,12504,5509,51246,72699,12780,5434

In [293]:
columns_multiindex = pd.MultiIndex.from_tuples([
    #('Gêneros', 'Províncias e Município Neutro'),
    ('', 'Províncias e Município Neutro'),
    ('dos Homens', 'Brancos'),
    ('dos Homens', 'Pardos'),
    ('dos Homens', 'Pretos'),
    ('dos Homens', 'Caboclos'),
    ('das Mulheres', 'Brancas'),
    ('das Mulheres', 'Pardas'),
    ('das Mulheres', 'Pretas'),
    ('das Mulheres', 'Caboclas')
])

# Atribuindo o MultiIndex às colunas do DataFrame
estados_civis.columns = columns_multiindex

estados_civis

ValueError: Length mismatch: Expected axis has 6 elements, new values have 9 elements

## Religiao

In [57]:
religiao = df[['Unnamed: 0','Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21']]
religiao.head()

,Unnamed: 0,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
0,NaN,Religião,NaN,NaN,NaN
1,NaN,dos Homens,NaN,das Mulheres,NaN
2,Províncias e Município Neutro,Católicos,Acatólicos,Católicas,Acatólicas
3,Amazonas,30903,80,25641,7
4,Pará,128396,193,119169,21

In [58]:
religiao_header = religiao.iloc[0]
religiao.columns = religiao_header
religiao = religiao[1:]
religiao.head()

,NaN,Religião,NaN,NaN,NaN
1,NaN,dos Homens,NaN,das Mulheres,NaN
2,Províncias e Município Neutro,Católicos,Acatólicos,Católicas,Acatólicas
3,Amazonas,30903,80,25641,7
4,Pará,128396,193,119169,21
5,Maranhão,141865,77,142100,59

## Nacionalidade

In [59]:
nacionalidade = df[['Unnamed: 0','Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25']]
nacionalidade.head()

,Unnamed: 0,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,NaN,Nacionalidades,NaN,NaN,NaN
1,NaN,dos Homens,NaN,das Mulheres,NaN
2,Províncias e Município Neutro,Brasileiros,Estrangeiros,Brasileiras,Estrangeiras
3,Amazonas,29223,1760,25222,426
4,Pará,123365,5224,118437,753

In [60]:
nacionalidade_header = nacionalidade.iloc[0]
nacionalidade.columns = nacionalidade_header
nacionalidade = nacionalidade[1:]
nacionalidade.head()

,NaN,Nacionalidades,NaN,NaN,NaN
1,NaN,dos Homens,NaN,das Mulheres,NaN
2,Províncias e Município Neutro,Brasileiros,Estrangeiros,Brasileiras,Estrangeiras
3,Amazonas,29223,1760,25222,426
4,Pará,123365,5224,118437,753
5,Maranhão,139413,2529,141191,968

## Instrução

In [61]:
instrucao = df[['Unnamed: 0','Instrução', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao.head()

,Unnamed: 0,Instrução,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35
0,NaN,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN
1,NaN,Homens,NaN,Mulheres,NaN,Meninos,NaN,NaN,Meninas,NaN,NaN
2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,6160,24823,1453,24195,824,5056,5880,371,3269,3640
4,Pará,39718,88871,20677,98513,5768,25753,31521,3441,25020,28461

In [62]:
instrucao_header = instrucao.iloc[0]
instrucao.columns = instrucao_header
instrucao = instrucao[1:]
instrucao.head()

,NaN,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN
1,NaN,Homens,NaN,Mulheres,NaN,Meninos,NaN,NaN,Meninas,NaN,NaN
2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,6160,24823,1453,24195,824,5056,5880,371,3269,3640
4,Pará,39718,88871,20677,98513,5768,25753,31521,3441,25020,28461
5,Maranhão,44375,97567,24196,117963,8739,28142,36881,4844,29567,34411

### Adultos

In [63]:
instrucao_adultos = df[['Unnamed: 0','Instrução', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29']]
instrucao_adultos.head()

,Unnamed: 0,Instrução,Unnamed: 27,Unnamed: 28,Unnamed: 29
0,NaN,NaN,NaN,NaN,NaN
1,NaN,Homens,NaN,Mulheres,NaN
2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas
3,Amazonas,6160,24823,1453,24195
4,Pará,39718,88871,20677,98513

In [64]:
instrucao_adultos_header = instrucao_adultos.iloc[1]
instrucao_adultos.columns = instrucao_adultos_header
instrucao_adultos = instrucao_adultos[2:]
instrucao_adultos.head()

1,NaN,Homens,NaN,Mulheres,NaN
2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas
3,Amazonas,6160,24823,1453,24195
4,Pará,39718,88871,20677,98513
5,Maranhão,44375,97567,24196,117963
6,Piauí,17677,72645,10093,78012

### Jovens

In [65]:
instrucao_jovens = df[['Unnamed: 0', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao_jovens.head()

,Unnamed: 0,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35
0,NaN,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN
1,NaN,Meninos,NaN,NaN,Meninas,NaN,NaN
2,Províncias e Município Neutro,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,824,5056,5880,371,3269,3640
4,Pará,5768,25753,31521,3441,25020,28461

In [66]:
instrucao_jovens_header = instrucao_jovens.iloc[0]
instrucao_jovens.columns = instrucao_jovens_header
instrucao_jovens = instrucao_jovens[1:]
instrucao_jovens.head()

,NaN,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN
1,NaN,Meninos,NaN,NaN,Meninas,NaN,NaN
2,Províncias e Município Neutro,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,824,5056,5880,371,3269,3640
4,Pará,5768,25753,31521,3441,25020,28461
5,Maranhão,8739,28142,36881,4844,29567,34411

## Casas

In [67]:
casas = df[['Unnamed: 0','Unnamed: 36', 'Unnamed: 37', 'Unnamed: 38']]
casas.head()

                      Unnamed: 0 Unnamed: 36  Unnamed: 37 Unnamed: 38
0                            NaN         NaN          NaN         NaN
1                            NaN       Casas          NaN         NaN
2  Províncias e Município Neutro   Habitadas  Desabitadas       Total
3                       Amazonas        7661          229        7890
4                           Pará       38978         2077       41055

In [68]:
casas_header = casas.iloc[1]
casas.columns = casas_header
casas = casas[2:]
casas.head()

1                            NaN      Casas          NaN    NaN
2  Províncias e Município Neutro  Habitadas  Desabitadas  Total
3                       Amazonas       7661          229   7890
4                           Pará      38978         2077  41055
5                       Maranhão      47166         1405  48571
6                          Piauí      29208          223  29431

## Fogos

In [69]:
fogos = df[['Unnamed: 0', 'Unnamed: 39']]
fogos.head()

                      Unnamed: 0      Unnamed: 39
0                            NaN              NaN
1                            NaN              NaN
2  Províncias e Município Neutro  Número de fogos
3                       Amazonas             7811
4                           Pará            39521

In [70]:
fogos_header = fogos.iloc[2]
fogos.columns = fogos_header
fogos = fogos[3:]
fogos.head()

2 Províncias e Município Neutro Número de fogos
3                      Amazonas            7811
4                          Pará           39521
5                      Maranhão           49282
6                         Piauí           30770
7                         Ceará          100207

# Parte 2: Pooulação total, livre e escrava

In [71]:
filename = "censo_1872-003_p2.csv"
path = pf.find_file(filename)
df = pd.read_csv(path)

df.head(10)

,Recapitulação,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37,Unnamed: 38,Unnamed: 39
0,População livre,4318699,4100973,8419672,2975446,1165866,177387,2752582,1121000,227391,...,155651,786131,941782,165098,795574,960672,1296060,34150,1330210,1332274
1,População escrava,805170,705636,1510806,711869,73079,20222,622804,63046,19816,...,155651,786131,941782,165098,795574,960672,1296060,34150,1330210,1332274
2,Total,512389,4806609,9930478,3687315,1238945,197609,3375386,1184016,247207,...,155651,786131,941782,165098,1332274,960672,1296060,34150,1330210,1332274

In [72]:
print(df.columns)

Index(['Recapitulação', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25',
       'Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29',
       'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33',
       'Unnamed: 34', 'Unnamed: 35', 'Unnamed: 36', 'Unnamed: 37',
       'Unnamed: 38', 'Unnamed: 39'],
      dtype='object')

## Sexos

In [73]:
sexos2 = df[['Recapitulação','Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3']]
sexos2 = sexos2.rename(columns={'Unnamed: 1': 'Homens', 'Unnamed: 2': 'Mulheres', 'Unnamed: 3': 'Total'})
sexos2.head()

       Recapitulação   Homens  Mulheres    Total
0    População livre  4318699   4100973  8419672
1  População escrava   805170    705636  1510806
2              Total   512389   4806609  9930478

## Estados civis

In [101]:
estados_civis2 = df[['Recapitulação','Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis2 = estados_civis2.rename(columns={'Unnamed: 4': 'Solteiros', 'Unnamed: 5': 'Casados', 'Unnamed: 6': 'Viúvos', 'Unnamed: 7': 'Solteiras', 'Unnamed: 8': 'Casadas', 'Unnamed: 9': 'Viúvas'})
estados_civis2.head()

KeyError: "['Recapitulação'] not in index"

## Raças

In [75]:
racas2 = df[['Recapitulação','Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17']]
racas2 = racas2.rename(columns={'Unnamed: 10': 'Brancos', 'Unnamed: 11': 'Pardos', 'Unnamed: 12': 'Pretos', 'Unnamed: 13': 'Caboclos', 'Unnamed: 14': 'Brancas', 'Unnamed: 15': 'Pardas', 'Unnamed: 16': 'Pretas', 'Unnamed: 17': 'Caboclas'})
racas2.head()

,Recapitulação,Brancos,Pardos,Pretos,Caboclos,Brancas,Pardas,Pretas,Caboclas
0,População livre,1971772,1673971,472008,200948,1815517,1650307,449142,186007
1,População escrava,0,252824,552346,0,0,224680,480956,0
2,Total,1971772,1926795,1024354,200948,1815517,1874987,930098,186007

## Religião

In [76]:
religiao2 = df[['Recapitulação','Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21']]
religiao2 = religiao2.rename(columns={'Unnamed: 18': 'Católicos', 'Unnamed: 19': 'Acatólicos', 'Unnamed: 20': 'Católicas', 'Unnamed: 21': 'Acatólicas'})
religiao2.head()

       Recapitulação  Católicos  Acatólicos  Católicas  Acatólicas
0    População livre    4302386       16313    4089520       11453
1  População escrava     895170           0     705636           0
2              Total    5107556       16313    4795156       11453

## Nacionalidade

In [77]:
nacionalidade2 = df[['Recapitulação','Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25']]
nacionalidade2 = nacionalidade2.rename(columns={'Unnamed: 22': 'Brasileiros', 'Unnamed: 23': 'Estrangeiros', 'Unnamed: 24': 'Brasileiras', 'Unnamed: 25': 'Estrangeiras'})
nacionalidade2.head()

       Recapitulação  Brasileiros  Estrangeiros  Brasileiras  Estrangeiras
0    População livre      4139362        179337      4036829         64144
1  População escrava       719630         35540       352616         53020
2              Total      4853992        264877      4689945        117164

## Instrução

In [78]:
instrucao2 = df[['Recapitulação','Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao2 = instrucao2.rename(columns={'Unnamed: 26': 'Sabem ler e escrever', 'Unnamed: 27': 'Analfabetos', 'Unnamed: 28': 'Sabem ler e escrever', 'Unnamed: 29': 'Analfabetas', 'Unnamed: 30': 'Frequentam escolas', 'Unnamed: 31': 'Não frequentam', 'Unnamed: 32': 'Total', 'Unnamed: 33': 'Frequentam escolas', 'Unnamed: 34': 'Não frequentam', 'Unnamed: 35': 'Total'})
instrucao2.head()

,Recapitulação,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
0,População livre,1012097,3306602,550981,3549992,155651,786131,941782,165098,795574,960672
1,População escrava,958,804212,445,705191,155651,786131,941782,165098,795574,960672
2,Total,1013055,4110814,551426,4255183,155651,786131,941782,165098,1332274,960672

### Adultos

In [79]:
instrucao_adultos2 = df[['Recapitulação','Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29']]
instrucao_adultos2 = instrucao_adultos2.rename(columns={'Unnamed: 26': 'Sabem ler e escrever', 'Unnamed: 27': 'Analfabetos', 'Unnamed: 28': 'Sabem ler e escrever', 'Unnamed: 29': 'Analfabetas'})
instrucao_adultos2.head()

,Recapitulação,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas
0,População livre,1012097,3306602,550981,3549992
1,População escrava,958,804212,445,705191
2,Total,1013055,4110814,551426,4255183

### Jovens

In [80]:
instrucao_jovens2 = df[['Recapitulação', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao_jovens2 = instrucao_jovens2.rename(columns={'Unnamed: 30': 'Frequentam escolas', 'Unnamed: 31': 'Não frequentam', 'Unnamed: 32': 'Total', 'Unnamed: 33': 'Frequentam escolas', 'Unnamed: 34': 'Não frequentam', 'Unnamed: 35': 'Total'})
instrucao_jovens2.head()

,Recapitulação,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
0,População livre,155651,786131,941782,165098,795574,960672
1,População escrava,155651,786131,941782,165098,795574,960672
2,Total,155651,786131,941782,165098,1332274,960672

## Casas

In [81]:
casas2 = df[['Recapitulação', 'Unnamed: 36', 'Unnamed: 37', 'Unnamed: 38']]
casas2 = casas2.rename(columns={'Unnamed: 36': 'Habitadas', 'Unnamed: 37': 'Desabitadas', 'Unnamed: 38': 'Total'})
casas2.head()

       Recapitulação  Habitadas  Desabitadas    Total
0    População livre    1296060        34150  1330210
1  População escrava    1296060        34150  1330210
2              Total    1296060        34150  1330210

## Fogos

In [82]:
fogos2 = df[['Recapitulação', 'Unnamed: 39']]
fogos2 = fogos2.rename(columns={'Recapitulação': '', 'Unnamed: 39': 'Fogos'})
fogos2.head()

                        Fogos
0    População livre  1332274
1  População escrava  1332274
2              Total  1332274

In [83]:
'''
data = {
    ('A', 'X'): [1, 2, 3],
    ('A', 'Y'): [4, 5, 6],
    ('B', 'X'): [7, 8, 9],
    ('B', 'Y'): [10, 11, 12]
}

# Create a DataFrame with multi-index columns
df = pd.DataFrame(data)

# Create multi-index header
header = pd.MultiIndex.from_tuples([('A', 'Group1'), ('A', 'Group2'), ('B', 'Group1'), ('B', 'Group2')])

# Assign the multi-index header to the DataFrame columns
df.columns = header

print(df)
'''

"\ndata = {\n    ('A', 'X'): [1, 2, 3],\n    ('A', 'Y'): [4, 5, 6],\n    ('B', 'X'): [7, 8, 9],\n    ('B', 'Y'): [10, 11, 12]\n}\n\n# Create a DataFrame with multi-index columns\ndf = pd.DataFrame(data)\n\n# Create multi-index header\nheader = pd.MultiIndex.from_tuples([('A', 'Group1'), ('A', 'Group2'), ('B', 'Group1'), ('B', 'Group2')])\n\n# Assign the multi-index header to the DataFrame columns\ndf.columns = header\n\nprint(df)\n"